Documents/КадровоеПеремещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>КадровоеПеремещение</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПлановыеУдержания</xr:Item>
				<xr:Item>InformationRegister.ПлановыеНачисления</xr:Item>
				<xr:Item>InformationRegister.РаботникиОрганизаций</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОткуда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКуда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипГрафика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыГрафиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Удержания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.Удержания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипГрафика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыГрафиков</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПлановыеНачисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПлановыеНачисления</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПлановыеУдержания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПлановыеУдержания</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Удержания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияРаботников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияРаботников</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Работает</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уволен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/КадровоеПеремещение/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.РаботникиОрганизаций.Очистить();
	Движения.РаботникиОрганизаций.Записать();
	
	Ресурсы = ПроверкаДокументов.ПолучитьРесурсыСотрудника(Сотрудник, ПодразделениеОткуда, МоментВремени());
	
	Если Ресурсы.Состояние<>Перечисления.СостоянияРаботников.Работает Тогда
	              
		Сообщить("Сотрудник здесь не работает");
		Отказ = Истина;
		Возврат;
	
	КонецЕсли; 
	
	
		Запись = Движения.РаботникиОрганизаций.Добавить();
		Запись.Период = Дата;
		Запись.Сотрудник = Сотрудник;
		Запись.Подразделение = ПодразделениеОткуда;
		Запись.Состояние = Перечисления.СостоянияРаботников.Уволен;
		Запись.ТипГрафика = ТипГрафика;
	
		Запись = Движения.РаботникиОрганизаций.Добавить();
		Запись.Период = КонецДня(Дата)+1;
		Запись.Сотрудник = Сотрудник;
		Запись.Подразделение = ПодразделениеКуда;
		Запись.Состояние = Перечисления.СостоянияРаботников.Работает;
		Запись.ТипГрафика = ТипГрафика;
		
		Движения.РаботникиОрганизаций.Записывать = Истина;
		
		
		
	
		ДанныеДокумента = Новый Структура;
		ДанныеДокумента.Вставить("Дата", Дата);
		ДанныеДокумента.Вставить("Сотрудник", Сотрудник);
		ДанныеДокумента.Вставить("Подразделение", ПодразделениеОткуда);
		ДанныеДокумента.Вставить("МоментВремени", МоментВремени());
		КадровыйУчет.ОбнулитьПлановыеНачисленияУдержания(ДанныеДокумента, Движения);
	// регистр ПлановыеНачисления
	Движения.ПлановыеНачисления.Записывать = Истина;
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл
		Движение = Движения.ПлановыеНачисления.Добавить();
		Движение.Период = КонецДня(Дата)+1;
		Движение.Сотрудник = Сотрудник;
		Движение.Подразделение = ПодразделениеКуда;
		Движение.ВидРасчета = ТекСтрокаНачисления.ВидРасчета;
		Движение.Значение = ТекСтрокаНачисления.Значение;
	КонецЦикла;

	// регистр ПлановыеУдержания
	Движения.ПлановыеУдержания.Записывать = Истина;
	Для Каждого ТекСтрокаУдержания Из Удержания Цикл
		Движение = Движения.ПлановыеУдержания.Добавить();
		Движение.Период = КонецДня(Дата)+1;
		Движение.Сотрудник = Сотрудник;
		Движение.Подразделение = ПодразделениеКуда;
		Движение.ВидРасчета = ТекСтрокаУдержания.ВидРасчета;
		Движение.Значение = ТекСтрокаУдержания.Значение;
	КонецЦикла;
	
КонецПроцедуры
